#+TITLE: July 16, 2019 - August 1, 2019 (17 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
#+TODO: TODO IN_PROGRESS WAITING DONE
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2019-07-16 Tue>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-jasonbraganza: 3
  :wpd-RJ722: 1.1
  :wpd-sandeepk: 1
  :END:
** akshay196
*** Linux Under the Hood [0/13]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1563242496
    :TASKID: READ.1563242496
    :END:
    - [ ] Lesson  1: How Linux is organized                            (25m)
    - [ ] Lesson  2: About C code, scripts and compiled programs       (35m)
    - [ ] Lesson  3: Understanding Linux commands and how they work    (22m)
    - [ ] Lesson  4: Understanding the Linux boot procedure            (90m)
    - [ ] Lesson  5: Understanding Linux storage                       (80m)
    - [ ] Lesson  6: Understanding memory management                   (40m)
    - [ ] Lesson  7: Understanding process                             (40m)
    - [ ] Lesson  8: Security                                          (60m)
    - [ ] Lesson  9: Hardware initialization                           (35m)
    - [ ] Lesson 10: Looking closer at the kernel                      (40m)
    - [ ] Lesson 11: Understanding networking                          (50m)
    - [ ] Lesson 12: Performance optimization                          (60m)
    - [ ] Lesson 13: The future of Linux                               (23m)
*** GNU Emacs bug triaging
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:
    :OWNER: akshay196
    :ID: OPS.1563244949
    :TASKID: OPS.1563244949
    :END:
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35393][#35393]]: `help-echo' text propertized with `face' is not shown in that face
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33858][#33858]]: 26.1; Scrolling up fails
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33092][#33092]]: 26.1; Re-running shell wipes font-lock from xterm-color
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33147][#33147]]: tex-mode: ${{{{a}}}}$ or more braces not highlighted
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=32388][#32388]]: 26.1: ediff-merge-directories-with-ancestor and subdirectories
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=31306][#31306]]: 27.0.50; js-mode still missing ES2015 keywords
** bhavin192
*** IN_PROGRESS Mastering Distributed Tracing - II. Data Gathering Problem [0/5]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:   3.17
    :OWNER:    bhavin192
    :ID:       READ.1562555265
    :TASKID:   READ.1562555265
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-21 Sun 12:30]--[2019-07-21 Sun 13:15] =>  0:45
    CLOCK: [2019-07-21 Sun 11:13]--[2019-07-21 Sun 12:08] =>  0:55
    CLOCK: [2019-07-20 Sat 22:39]--[2019-07-20 Sat 22:41] =>  0:02
    CLOCK: [2019-07-20 Sat 22:18]--[2019-07-20 Sat 22:26] =>  0:08
    CLOCK: [2019-07-20 Sat 12:27]--[2019-07-20 Sat 12:51] =>  0:24
    CLOCK: [2019-07-17 Wed 22:03]--[2019-07-17 Wed 22:28] =>  0:25
    CLOCK: [2019-07-17 Wed 19:57]--[2019-07-17 Wed 20:28] =>  0:31
    :END:
    - [ ] 4. Instrumentation Basics with OpenTracing           (3.5h)
    - [ ] 5. Instrumentation of Asynchronous Applications      (1.5h)
    - [ ] 6. Tracing Standards and Ecosystem                   (1.5h)
    - [ ] 7. Tracing with Service Meshes                       (2.0h)
    - [ ] 8. All About Sampling                                (1.5h)
*** Helm 3 Preview: Charting Our Future [0/7]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1562524270
    :TASKID:   READ.1562524270
    :END:
    - [ ] [[https://helm.sh/blog/helm-3-preview-pt1/][Part 1: A History of Helm]]		(15m)
    - [ ] [[https://helm.sh/blog/helm-3-preview-pt2/][Part 2: A Gentle Farewell to Tiller]]	(10m)
    - [ ] [[https://helm.sh/blog/helm-3-preview-pt3/][Part 3: Chart Repositories]]		(10m)
    - [ ] [[https://helm.sh/blog/helm-3-preview-pt4/][Part 4: Release Management]]		(10m)
    - [ ] [[https://helm.sh/blog/helm-3-preview-pt5/][Part 5: Changes to Chart Dependencies]]	( 5m)
    - [ ] [[https://helm.sh/blog/helm-3-preview-pt6/][Part 6: Introducing Library Charts]]	( 5m)
    - [ ] [[https://helm.sh/blog/helm-3-preview-pt7/][Part 7: What's Next?]]			(10m)
*** Write blog post about Python Pune
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1563295962
    :TASKID:   WRITE.1563295962
    :END:

** gandalfdwite
*** Unix Concepts & Applications by Sumitabha Das [0/3]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:   0.00
   :OWNER: gandalfdwite
   :ID: READ.1553532278
   :TASKID: READ.1553532278
   :END:
   - [ ] 16. X Window System                     ( 2h)
   - [ ] 17. Networking tools                    ( 2h)
   - [ ] 18. awk                                 ( 2h)
*** Org-capture [0/1]
    :PROPERTIES:
    :ESTIMATED: 1.5
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1562385851
    :TASKID: READ.1562385851
    :END:
    - [ ] Read and setup org-capture    ( 1.5h)
*** Org-agenda [0/1]
    :PROPERTIES:
    :ESTIMATED: 1.5
    :ACTUAL:
    :OWNER:    gandalfdwite
    :ID:       READ.1562385906
    :TASKID:   READ.1562385906
    :END:
    - [ ] Read and setup org-agenda     ( 1.5h)
*** Work on Chaostoolkit [0/2]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: DEV.1563199235
    :TASKID: DEV.1563199235
    :END:
    - [ ] 1. Understanding ChaosToolkit      ( 1h )
    - [ ] 2. Issue Triaging                  ( 7h )
** jasonbraganza
*** IN_PROGRESS Work at French, in the Fluent forever app - Part IV [2/11]
   :PROPERTIES:
   :ESTIMATED: 11
   :ACTUAL:   1.75
   :OWNER: jasonbraganza
   :ID: WRITE.1557903518
   :TASKID: WRITE.1557903518
   :END:
   :LOGBOOK:
   CLOCK: [2019-07-22 Mon 06:45]--[2019-07-22 Mon 07:45] =>  1:00
   CLOCK: [2019-07-21 Sun 07:00]--[2019-07-21 Mon 07:45] =>  0:45
   :END:
   - [X] Complete 1 review session & add 5 words to vocabulary (1h)
   - [X] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
   - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
*** IN_PROGRESS Write twice a week - 2 [2/5]
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:   2.45
   :OWNER: jasonbraganza
   :ID: WRITE.1559630427
   :TASKID: WRITE.1559630427
   :END:
   :LOGBOOK:
   CLOCK: [2019-07-22 Mon 09:30]--[2019-07-22 Mon 10:27] =>  0:57
   CLOCK: [2019-07-21 Sun 19:00]--[2019-07-21 Sun 20:30] =>  1:30
   :END:
   - [X] Write a short blog post. (1h)
   - [X] Write a short blog post. (1h)
   - [ ] Write a short blog post. (1h)
   - [ ] Write a short blog post. (1h)
   - [ ] Write a short blog post. (1h)
*** IN_PROGRESS Read fiction [0/11]
   :PROPERTIES:
   :ESTIMATED: 3
   :ACTUAL:   
   :OWNER: jasonbraganza
   :ID: READ.1559630918
   :TASKID: READ.1559630918
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-13 Tue 08:30]--[2019-06-13 Thu 12:30] =>  4:00
   CLOCK: [2019-06-09 Sun 10:00]--[2019-06-09 Sun 12:00] =>  2:00
   CLOCK: [2019-06-06 Thu 11:00]--[2019-06-06 Thu 13:01] =>  2:01
   CLOCK: [2019-06-05 Wed 23:35]--[2019-06-06 Thu 00:45] =>  1:10
   CLOCK: [2019-06-05 Wed 09:09]--[2019-06-05 Wed 09:11] =>  0:02
   CLOCK: [2019-06-04 Tue 13:00]--[2019-06-04 Tue 13:55] =>  0:55
   :END:
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
   - [ ] Read 5 pages of The Kingdom of Gods, N. K. Jemisin  (15m)
*** IN_PROGRESS Introduction to Computer Science and Programming Using Python - Part II [0/3]
   :PROPERTIES:
   :ESTIMATED: 15
   :ACTUAL:   
   :OWNER: jasonbraganza
   :ID: READ.1559713451
   :TASKID: READ.1559713451
   :END:
   :LOGBOOK:
   :END:
   - [ ] Watch Week 4 videos. (2h)
   - [ ] Watch Week 5 videos. (7h)
   - [ ] Watch Week 6 videos. (6h)
*** IN_PROGRESS NIOS - Geography - Part I [0/5]
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:
   :OWNER: jasonbraganza
   :ID: READ.1563626394
   :TASKID: READ.1563626394
   :END:
   - [ ] Read Chapter 5. (1h)
   - [ ] Read Chapter 6. (1h)
   - [ ] Read Chapter 7. (1h)
   - [ ] Read Chapter 8. (1h)
   - [ ] Read Chapter 9. (1h)
** RJ722
*** IN_PROGRESS Watch first lecture of fastai part-2
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   2.37
    :OWNER: RJ722
    :ID: TASK.1562243970
    :TASKID: TASK.1562243970
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-22 Mon 11:40]--[2019-07-22 Mon 13:13] =>  1:33
    CLOCK: [2019-07-21 Sun 23:14]--[2019-07-21 Sun 23:28] =>  0:14
    CLOCK: [2019-07-21 Sun 19:11]--[2019-07-21 Sun 19:46] =>  0:35
    :END:
*** Write 2 blog posts [0/2]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: RJ722
    :ID: WRITE.1558159950
    :TASKID: WRITE.1558159950
    :END:
    - [ ] Blog Post 1
    - [ ] Blog Post 2
*** IN_PROGRESS Read first 6 chapters of "Grokking Deep Learning" by Andrew Trask [2/6]
    :PROPERTIES:
    :ESTIMATED: 12
    :ACTUAL:
    :OWNER: RJ722
    :ID: READ.1563523155
    :TASKID: READ.1563523155
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-21 Sun 23:31]--[2019-07-22 Mon 00:04] =>  0:33
    CLOCK: [2019-07-19 Fri 16:09]--[2019-07-19 Fri 16:10] =>  0:01
    :END:
    - [X] Introducing Deep Learning
    - [X] Fundamental Concepts
    - [ ] Introduction to Neural Prediction
    - [ ] Introduction to Neural Learning
    - [ ] Learning Multiple Weights at a time
    - [ ] Building your first neural network

** sandeepk
*** Project Stack NEWS - Part IV [0/1]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: sandeepk
    :ID: DEV.1552226887
    :TASKID: DEV.1552226887
    :END:
    - [ ] Write test case for POST section (5h)
*** Blog writing - Part III [0/2]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER:    sandeepk
    :ID:       WRITE.1563376502
    :TASKID:   WRITE.1563376502
    :END:
    - [ ] Load Balancer	Setup guide             (6h)
    - [ ] I want 2 do project tell me what 2 do (2h)
*** Reading The Hitchhiker's Guide to Python! [0/3]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER:    sandeepk
    :ID:       READ.1563376642
    :TASKID:   READ.1563376642
    :END:
    - [ ] Documentation        (40m)
    - [ ] Testing your code    (3h)
    - [ ] Logging              (2h 20m)
